[Accesor 접근자]
-  str, datetime의 method에 접근할 수 있는 기능 제공
- Series의 모든 원소가 str 또는 datetime일 경우 사용 가능함
- 방법
    * Series변수명.str.문자열 관련 method
    * Series변수명.dt.Datetime 관련 method

In [14]:
# [1-1] 모듈로딩
import pandas as pd
import numpy as np

In [15]:
# [1-2] 데이터 준비
dataDF=pd.DataFrame([['홍 길동',20,'학생','2010-10-15'],
                     ['마 징가',22,'직장인','2011-12-24']
                     ,['로 버트',30,'학생','2013-10-15']
                     ,['원더 우먼',22,'직장인','2011-12-15']])
dataDF

       0   1    2           3
0   홍 길동  20   학생  2010-10-15
1   마 징가  22  직장인  2011-12-24
2   로 버트  30   학생  2013-10-15
3  원더 우먼  22  직장인  2011-12-15

[Accesor 사용] <hr>

In [16]:
# [2-1] str
nameSR=dataDF[0]
nameSR.str.split(' ',expand=True)

    0   1
0   홍  길동
1   마  징가
2   로  버트
3  원더  우먼

In [24]:
nameSR=dataDF[3]
ymdDF=nameSR.str.split('-',expand=True)
ymdDF.groupby(by=0)
ymdDF

      0   1   2
0  2010  10  15
1  2011  12  24
2  2013  10  15
3  2011  12  15

In [30]:
# [2-2] dt(datetime)
DF=pd.Series(['1/1/2020','2/1/2020'])
DF1=pd.to_datetime(DF)
DF1.dt.day_of_week

0    2
1    5
dtype: int32

In [29]:
DF.astype('datetime64[ns]')

0   2020-01-01
1   2020-02-01
dtype: datetime64[ns]